zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_aes.h
/*@}*/ /* end of group AES_DMA_TRIG0 */

/** @addtogroup AES_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001020) Interrupt Index Register */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001048) Interrupt clear */
} AES_CPU_INT_Regs;

/*@}*/ /* end of group AES_CPU_INT */

/** @addtogroup AES_GPRCM
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00000800) Power enable */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00000804) Reset Control */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00000814) Status Register */
} AES_GPRCM_Regs;

/*@}*/ /* end of group AES_GPRCM */

/** @addtogroup AES
  @{
*/

/* AES加速器主寄存器结构体 - 包含GPRCM电源管理、中断、DMA触发和AES核心寄存器 */
typedef struct {
       uint32_t RESERVED0[512];
  AES_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00000800) 电源/复位/时钟管理 */
       uint32_t RESERVED1[512];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00001018) 外设调试控制 */
       uint32_t RESERVED2;
  AES_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00001020) CPU中断寄存器组 */
       uint32_t RESERVED3;
  AES_DMA_TRIG0_Regs  DMA_TRIG0;                         /* !< (@ 0x00001050) DMA触发0(数据输入触发) */
       uint32_t RESERVED4;
  AES_DMA_TRIG1_Regs  DMA_TRIG1;                         /* !< (@ 0x00001080) DMA触发1(数据输出触发) */
       uint32_t RESERVED5;
  AES_DMA_TRIG2_Regs  DMA_TRIG2;                         /* !< (@ 0x000010B0) DMA触发2 */
       uint32_t RESERVED6;
  __IO uint32_t EVT_MODE;                          /* !< (@ 0x000010E0) 事件模式配置 */
       uint32_t RESERVED7[7];
  __IO uint32_t AESACTL0;                          /* !< (@ 0x00001100) AES控制0: 操作模式/密钥长度/分组模式/DMA使能 */
  __IO uint32_t AESACTL1;                          /* !< (@ 0x00001104) AES控制1: 分组块计数器 */
  __IO uint32_t AESASTAT;                          /* !< (@ 0x00001108) AES状态: 忙/密钥已写/数据已写/输出已读 */
  __O  uint32_t AESAKEY;                           /* !< (@ 0x0000110C) AES密钥寄存器(只写, 逐字节/字写入) */
  __O  uint32_t AESADIN;                           /* !< (@ 0x00001110) AES数据输入寄存器(只写) */
  __I  uint32_t AESADOUT;                          /* !< (@ 0x00001114) AES数据输出寄存器(只读) */
  __O  uint32_t AESAXDIN;                          /* !< (@ 0x00001118) AES异或数据输入寄存器(只写, 触发运算) */
  __O  uint32_t AESAXIN;                           /* !< (@ 0x0000111C) AES异或数据输入寄存器(只写, 不触发运算) */
} AES_Regs;

/*@}*/ /* end of group AES */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* AES Register Control Bits - AES寄存器位域定义
* 包含：中断/DMA触发、电源/复位控制、事件模式、AES控制/状态/密钥/数据位域
******************************************************************************/

/* AES_DMA_TRIG2_IIDX Bits */
/* AES_DMA_TRIG2_IIDX[STAT] Bits */
#define AES_DMA_TRIG2_IIDX_STAT_OFS              (0)                             /* !< STAT Offset */
#define AES_DMA_TRIG2_IIDX_STAT_MASK             ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define AES_DMA_TRIG2_IIDX_STAT_NO_INTR          ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define AES_DMA_TRIG2_IIDX_STAT_DMA2             ((uint32_t)0x00000004U)         /* !< AES trigger 2 DMA */

/* AES_DMA_TRIG2_IMASK Bits */
/* AES_DMA_TRIG2_IMASK[DMA2] Bits */
#define AES_DMA_TRIG2_IMASK_DMA2_OFS             (3)                             /* !< DMA2 Offset */
#define AES_DMA_TRIG2_IMASK_DMA2_MASK            ((uint32_t)0x00000008U)         /* !< DMA2 event mask. */
#define AES_DMA_TRIG2_IMASK_DMA2_CLR             ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AES_DMA_TRIG2_IMASK_DMA2_SET             ((uint32_t)0x00000008U)         /* !< Set Interrrupt Mask */

/* AES_DMA_TRIG2_RIS Bits */
/* AES_DMA_TRIG2_RIS[DMA2] Bits */
#define AES_DMA_TRIG2_RIS_DMA2_OFS               (3)                             /* !< DMA2 Offset */
#define AES_DMA_TRIG2_RIS_DMA2_MASK              ((uint32_t)0x00000008U)         /* !< DMA2 event */
#define AES_DMA_TRIG2_RIS_DMA2_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define AES_DMA_TRIG2_RIS_DMA2_SET               ((uint32_t)0x00000008U)         /* !< Interrupt occured */

/* AES_DMA_TRIG2_MIS Bits */
/* AES_DMA_TRIG2_MIS[DMA2] Bits */
#define AES_DMA_TRIG2_MIS_DMA2_OFS               (3)                             /* !< DMA2 Offset */
#define AES_DMA_TRIG2_MIS_DMA2_MASK              ((uint32_t)0x00000008U)         /* !< DMA2 event */
#define AES_DMA_TRIG2_MIS_DMA2_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define AES_DMA_TRIG2_MIS_DMA2_SET               ((uint32_t)0x00000008U)         /* !< Interrupt occured */

/* AES_DMA_TRIG2_ISET Bits */
/* AES_DMA_TRIG2_ISET[DMA2] Bits */
#define AES_DMA_TRIG2_ISET_DMA2_OFS              (3)                             /* !< DMA2 Offset */
#define AES_DMA_TRIG2_ISET_DMA2_MASK             ((uint32_t)0x00000008U)         /* !< DMA2 event */
#define AES_DMA_TRIG2_ISET_DMA2_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define AES_DMA_TRIG2_ISET_DMA2_SET              ((uint32_t)0x00000008U)         /* !< Set Interrupt */

/* AES_DMA_TRIG2_ICLR Bits */
/* AES_DMA_TRIG2_ICLR[DMA2] Bits */
#define AES_DMA_TRIG2_ICLR_DMA2_OFS              (3)                             /* !< DMA2 Offset */
#define AES_DMA_TRIG2_ICLR_DMA2_MASK             ((uint32_t)0x00000008U)         /* !< DMA2 event */
#define AES_DMA_TRIG2_ICLR_DMA2_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define AES_DMA_TRIG2_ICLR_DMA2_CLR              ((uint32_t)0x00000008U)         /* !< Clear Interrupt */

/* AES_DMA_TRIG1_IIDX Bits */
/* AES_DMA_TRIG1_IIDX[STAT] Bits */
#define AES_DMA_TRIG1_IIDX_STAT_OFS              (0)                             /* !< STAT Offset */
#define AES_DMA_TRIG1_IIDX_STAT_MASK             ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define AES_DMA_TRIG1_IIDX_STAT_NO_INTR          ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define AES_DMA_TRIG1_IIDX_STAT_DMA1             ((uint32_t)0x00000003U)         /* !< AES trigger 1 DMA */

/* AES_DMA_TRIG1_IMASK Bits */
/* AES_DMA_TRIG1_IMASK[DMA1] Bits */
#define AES_DMA_TRIG1_IMASK_DMA1_OFS             (2)                             /* !< DMA1 Offset */
#define AES_DMA_TRIG1_IMASK_DMA1_MASK            ((uint32_t)0x00000004U)         /* !< DMA1 event mask. */
#define AES_DMA_TRIG1_IMASK_DMA1_CLR             ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AES_DMA_TRIG1_IMASK_DMA1_SET             ((uint32_t)0x00000004U)         /* !< Set Interrrupt Mask */

