zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_aes.h
/* AES_AESASTAT Bits - AES状态寄存器(忙/密钥/数据写入状态) */
/* AES_AESASTAT[BUSY] Bits - AES模块忙: 0=空闲 1=正在运算 */
#define AES_AESASTAT_BUSY_OFS                    (0)                             /* !< BUSY Offset */
#define AES_AESASTAT_BUSY_MASK                   ((uint32_t)0x00000001U)         /* !< AES accelerator module busy;
                                                                                    encryption, decryption, or key
                                                                                    generation in progress.  0 = Not busy
                                                                                    1 = Busy */
#define AES_AESASTAT_BUSY_IDLE                   ((uint32_t)0x00000000U)         /* !< Not busy */
#define AES_AESASTAT_BUSY_BUSY                   ((uint32_t)0x00000001U)         /* !< Busy */
/* AES_AESASTAT[KEYWR] Bits */
#define AES_AESASTAT_KEYWR_OFS                   (1)                             /* !< KEYWR Offset */
#define AES_AESASTAT_KEYWR_MASK                  ((uint32_t)0x00000002U)         /* !< All bytes written to AESAKEY. This
                                                                                    bit can be modified by software but
                                                                                    it must not be reset by software (10)
                                                                                    if AESCMEN=1. Changing its state by
                                                                                    software also resets the AESKEYCNTx
                                                                                    bits. AESKEYWR is reset by PUC,
                                                                                    AESSWRST, an error condition,
                                                                                    changing AESOPx, changing AESKLx, and
                                                                                    the start to (over)write a new key.
                                                                                    Because it is reset when AESOPx is
                                                                                    changed it can be set by software
                                                                                    again to indicate that the loaded key
                                                                                    is still valid. */
#define AES_AESASTAT_KEYWR_NALL                  ((uint32_t)0x00000000U)         /* !< Not all bytes written */
#define AES_AESASTAT_KEYWR_ALL                   ((uint32_t)0x00000002U)         /* !< All bytes written */
/* AES_AESASTAT[DINWR] Bits */
#define AES_AESASTAT_DINWR_OFS                   (2)                             /* !< DINWR Offset */
#define AES_AESASTAT_DINWR_MASK                  ((uint32_t)0x00000004U)         /* !< All 16 bytes written to AESADIN,
                                                                                    AESAXDIN or AESAXIN. Changing its
                                                                                    state by software also resets the
                                                                                    AESDINCNTx bits. AESDINWR is reset by
                                                                                    PUC, AESSWRST, an error condition,
                                                                                    changing AESOPx, changing AESKLx, the
                                                                                    start to (over)write the data, and
                                                                                    when the AES accelerator is busy.
                                                                                    Because it is reset when AESOPx or
                                                                                    AESKLx is changed it can be set by
                                                                                    software again to indicate that the
                                                                                    current data is still valid.  0 = Not
                                                                                    all bytes written  1 = All bytes
                                                                                    written */
#define AES_AESASTAT_DINWR_NALL                  ((uint32_t)0x00000000U)         /* !< Not all bytes written */
#define AES_AESASTAT_DINWR_ALL                   ((uint32_t)0x00000004U)         /* !< All bytes written */
/* AES_AESASTAT[DOUTRD] Bits */
#define AES_AESASTAT_DOUTRD_OFS                  (3)                             /* !< DOUTRD Offset */
#define AES_AESASTAT_DOUTRD_MASK                 ((uint32_t)0x00000008U)         /* !< All 16 bytes read from AESADOUT.
                                                                                    AESDOUTRD is reset by PUC, AESSWRST,
                                                                                    an error condition, changing AESOPx,
                                                                                    changing AESKLx, when the AES
                                                                                    accelerator is busy, and when the
                                                                                    output data is read again.  0 = Not
                                                                                    all bytes read 1 = All bytes read */
#define AES_AESASTAT_DOUTRD_NALL                 ((uint32_t)0x00000000U)         /* !< Not all bytes read */
#define AES_AESASTAT_DOUTRD_ALL                  ((uint32_t)0x00000008U)         /* !< All bytes read */
/* AES_AESASTAT[KEYCNTX] Bits */
#define AES_AESASTAT_KEYCNTX_OFS                 (4)                             /* !< KEYCNTX Offset */
#define AES_AESASTAT_KEYCNTX_MASK                ((uint32_t)0x000000F0U)         /* !< Bytes written to AESAKEY when
                                                                                    AESKLx = 00, half-words written to
                                                                                    AESAKEY if AESKLx = b10. Reset when
                                                                                    AESKEYWR is reset. If AESKEYCNTx = 0
                                                                                    and AESKEYWR = 0, no bytes were
                                                                                    written. If AESKEYCNTx = 0 and
                                                                                    AESKEYWR = 1, all bytes were written. */
#define AES_AESASTAT_KEYCNTX_MINNUM              ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define AES_AESASTAT_KEYCNTX_MAXNUM              ((uint32_t)0x000000F0U)         /* !< Highest possible value */
/* AES_AESASTAT[DINCNTX] Bits */
#define AES_AESASTAT_DINCNTX_OFS                 (8)                             /* !< DINCNTX Offset */
#define AES_AESASTAT_DINCNTX_MASK                ((uint32_t)0x00000F00U)         /* !< Bytes written to AESADIN, AESAXDIN
                                                                                    or AESAXIN. Reset when AESDINWR is
                                                                                    reset. If AESDINCNTx = 0 and AESDINWR
                                                                                    = 0, no bytes were written. If
                                                                                    AESDINCNTx = 0 and AESDINWR = 1, all
                                                                                    bytes were written. */
#define AES_AESASTAT_DINCNTX_MINNUM              ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define AES_AESASTAT_DINCNTX_MAXNUM              ((uint32_t)0x00000F00U)         /* !< Highest possible value */
/* AES_AESASTAT[DOUTCNTX] Bits */
#define AES_AESASTAT_DOUTCNTX_OFS                (12)                            /* !< DOUTCNTX Offset */
#define AES_AESASTAT_DOUTCNTX_MASK               ((uint32_t)0x0000F000U)         /* !< Bytes read from AESADOUT. Reset
                                                                                    when AESDOUTRD is reset. If
                                                                                    AESDOUTCNTx = 0 and AESDOUTRD = 0, no
                                                                                    bytes were read. If AESDOUTCNTx = 0
                                                                                    and AESDOUTRD = 1, all bytes were
                                                                                    read. */
#define AES_AESASTAT_DOUTCNTX_MINNUM             ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define AES_AESASTAT_DOUTCNTX_MAXNUM             ((uint32_t)0x0000F000U)         /* !< Highest possible value */

/* AES_AESAKEY Bits - AES密钥寄存器(只写, 字节/字模式写入128/256位密钥) */
/* AES_AESAKEY[KEY0X] Bits - 密钥字节n(字模式)/下一字节(字节模式) */
#define AES_AESAKEY_KEY0X_OFS                    (0)                             /* !< KEY0X Offset */
#define AES_AESAKEY_KEY0X_MASK                   ((uint32_t)0x000000FFU)         /* !< AES key byte n when AESAKEY is
                                                                                    written as word. AES next key byte
                                                                                    when AESAKEY is written as byte. Do
                                                                                    not mix word and byte access. Always
                                                                                    reads as zero. The key is reset by
                                                                                    PUC or by AESSWRST = 1. */
#define AES_AESAKEY_KEY0X_MINNUM                 ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define AES_AESAKEY_KEY0X_MAXNUM                 ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* AES_AESAKEY[KEY1X] Bits */
#define AES_AESAKEY_KEY1X_OFS                    (8)                             /* !< KEY1X Offset */
#define AES_AESAKEY_KEY1X_MASK                   ((uint32_t)0x0000FF00U)         /* !< AES key byte n+1 when AESAKEY is
                                                                                    written as word. Do not use these
                                                                                    bits for byte access. Do not mix word
                                                                                    and byte access. Always reads as
                                                                                    zero. The key is reset by PUC or by
                                                                                    AESSWRST = 1. */
#define AES_AESAKEY_KEY1X_MINNUM                 ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define AES_AESAKEY_KEY1X_MAXNUM                 ((uint32_t)0x0000FF00U)         /* !< Highest possible value */
/* AES_AESAKEY[KEY2X] Bits */
#define AES_AESAKEY_KEY2X_OFS                    (16)                            /* !< KEY2X Offset */
#define AES_AESAKEY_KEY2X_MASK                   ((uint32_t)0x00FF0000U)         /* !< AES key byte n+2 when AESAKEY is
                                                                                    written as word. Do not use these
                                                                                    bits for byte access. Do not mix word
                                                                                    and byte access. Always reads as
                                                                                    zero. The key is reset by PUC or by
                                                                                    AESSWRST = 1. */
#define AES_AESAKEY_KEY2X_MINNUM                 ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define AES_AESAKEY_KEY2X_MAXNUM                 ((uint32_t)0x00FF0000U)         /* !< Highest possible value */
/* AES_AESAKEY[KEY3X] Bits */
#define AES_AESAKEY_KEY3X_OFS                    (24)                            /* !< KEY3X Offset */
#define AES_AESAKEY_KEY3X_MASK                   ((uint32_t)0xFF000000U)         /* !< AES key byte n+3 when AESAKEY is
                                                                                    written as word. Do not use these
                                                                                    bits for byte access. Do not mix word
                                                                                    and byte access. Always reads as
                                                                                    zero. The key is reset by PUC or by
                                                                                    AESSWRST = 1. */
#define AES_AESAKEY_KEY3X_MINNUM                 ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define AES_AESAKEY_KEY3X_MAXNUM                 ((uint32_t)0xFF000000U)         /* !< Highest possible value */

